{"name": "Amar Kumar", "profile": "MLAI | NLP | Researcher | Data Science Leader •      19+ Years of rich experience spanning across multiple types of industries, domains, and technologies.\n•      A hands-on data scientist and technologist with 9 years of intense experience in data science and educational background in MLAI , business and engineering\n•      An agile leader who can deal ambiguity comfortably and overcome complex challenges\n•      Capable of building high-performance teams comprising of Solution Architects, Data Scientists, Data Engineers etc. \n•      A panelist and guest lecturer for master level data science programs\n•      Expertise in data product development, Client Relationship Management and business consulting\n•      Experience in working with C-level executives.\n•\tLooking forward to play key role in MLAI, NLP, AI strategy, and consulting\n\nFunctions: \tStrategy, Supply Chain Management, Operations\nDomain:\t        Banking, Finance, Manufacturing, Healthcare, Legal AI/ML Leader to be announced Sep 2022 - Present · 1 mo Empowering every person and every organization on the planet to achieve more.\nTrusting technology and people to achieve the objective.\nCommitted to my growth and my company's customers and culture. . Senior Data Science Manager Coats · Full-time Nov 2018 - Aug 2022 · 3 yrs 10 mos Pune Area, India Statistical Modelling & Machine Learning Methodologies\n- Conducted extensive research on demand forecasting of  10 K of SKUs linked with Fashion industry (dynamic lot sizing)\n- Concocted Sales Forecasting method with 95% accuracy using Bayesian approach and prophet library\n- Performed Cluster analysis of the customers to improve service level of the premium customers\nInitiated analytical way to predict fastness failure of dyed thread using classification model and identify key drivers of failures\n- Developed product recommendation algorithm to suggest the most similar products available in warehouse\nProject Delivery and People Management\n- Led the global cross functional team involving from development to deployment of the machine learning models.\n- Directed the team in data science problem formulation.\n- Headed the identification of the right KPIs /  measurement frameworks against  business challenges.\nKey Achievements\n- The product recommendation system helped generate additional $ 5M in revenue per year . Senior Specialist Data Scientist NICE Actimize Jun 2017 - Oct 2018 · 1 yr 5 mos Pune - Core team member of a green field premium product ActimizeWatch\n- Developed fraud detection models for leading global banks.\n- Mentored a team of data scientists . Manager- Data Scientist Exela Technologies (Earlier BancTec, SourceHOV) May 2016 - Jun 2017 · 1 yr 2 mos Pune Area, India NLP/Text Mining\nHealthcare Analytics\nEnergy Analytics\nLegal Case Summarization . Senior Delivery Manager Atos May 2013 - May 2016 · 3 yrs 1 mo Pune Predictive Analytics- from Bid to Delivery in Manufacturing domain. . Senior Consultant IBM India Pvt. Ltd. May 2011 - Jun 2012 · 1 yr 2 mos Kolkata Manufactuing and Supply Chain Management Consulting . Associate Consultant WIPRO Mar 2006 - May 2011 · 5 yrs 3 mos Hyderabad Area, India ERP Implementation\n•\tLed the consulting teams (size 3- 20) and core teams (size 20- 50, multinational cross functional groups) in SAP implementation projects (Metal, Paper, Thread and Chemical industries)to deliver well integrated design.\n•\tSuccessfully led business blueprinting, realization, data migration and cutover of large ERP projects. . Supply Chain Management Consultant CROWN SOLUTIONS Mar 2006 - Jul 2006 · 5 mos SAP Consultant . Assistant Manager BRAMCO WLL Aug 2002 - Nov 2004 · 2 yrs 4 mos Assistant Manager- Operation . Machine Learning,Deep Learning,Artificial Intelligence (AI),Data Science,Analytics,Statistical Data Analysis,Management Consulting,Business Strategy,Solution Architecture,Program Management,Enterprise Resource Planning (ERP),Business Process Improvement,SAP,R,SQL,Azure Databricks,Microsoft Azure Machine Learning,Management,Statistical Inference,Supply Chain Consulting,Machine Learning Algorithms,Machine Learning,Deep Learning,Artificial Intelligence (AI),Data Science,Analytics,Statistical Data Analysis,Management Consulting,Business Strategy,Solution Architecture,Program Management,Enterprise Resource Planning (ERP),Business Process Improvement,Statistical Inference,Supply Chain Consulting,Machine Learning Algorithms,SAP,R,SQL,Azure Databricks,Microsoft Azure Machine Learning,Management"}